tests/siege/outputFiles/stdErr.txt
** SIEGE 4.1.6
** Preparing 1 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		       16371 hits
Availability:		      100.00 %
Elapsed time:		       20.12 secs
Data transferred:	        2.42 MB
Response time:		        0.00 secs
Transaction rate:	      813.67 trans/sec
Throughput:		        0.12 MB/sec
Concurrency:		        0.89
Successful transactions:           0
Failed transactions:	           0
Longest transaction:	        0.47
Shortest transaction:	        0.00
 
** SIEGE 4.1.6
** Preparing 20 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		        1381 hits
Availability:		      100.00 %
Elapsed time:		       20.91 secs
Data transferred:	        0.20 MB
Response time:		        0.30 secs
Transaction rate:	       66.04 trans/sec
Throughput:		        0.01 MB/sec
Concurrency:		       19.99
Successful transactions:           0
Failed transactions:	           0
Longest transaction:	       19.81
Shortest transaction:	        0.00
 
** SIEGE 4.1.6
** Preparing 50 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		       15035 hits
Availability:		      100.00 %
Elapsed time:		       20.98 secs
Data transferred:	        2.22 MB
Response time:		        0.05 secs
Transaction rate:	      716.63 trans/sec
Throughput:		        0.11 MB/sec
Concurrency:		       34.73
Successful transactions:           0
Failed transactions:	           0
Longest transaction:	        0.91
Shortest transaction:	        0.00
 
** SIEGE 4.1.6
** Preparing 100 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		         966 hits
Availability:		      100.00 %
Elapsed time:		       20.97 secs
Data transferred:	        0.14 MB
Response time:		        1.43 secs
Transaction rate:	       46.07 trans/sec
Throughput:		        0.01 MB/sec
Concurrency:		       65.83
Successful transactions:           0
Failed transactions:	           0
Longest transaction:	       13.35
Shortest transaction:	        0.00
 
** SIEGE 4.1.6
** Preparing 150 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		       15554 hits
Availability:		      100.00 %
Elapsed time:		       20.31 secs
Data transferred:	        2.30 MB
Response time:		        0.15 secs
Transaction rate:	      765.83 trans/sec
Throughput:		        0.11 MB/sec
Concurrency:		      114.19
Successful transactions:           0
Failed transactions:	           0
Longest transaction:	        1.76
Shortest transaction:	        0.00
 
** SIEGE 4.1.6
** Preparing 200 concurrent users for battle.
The server is now under siege...
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: read error Connection reset by peer sock.c:635: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[...]

Lifting the server siege...
Transactions:		        4717 hits
Availability:		       99.66 %
Elapsed time:		       20.91 secs
Data transferred:	        0.70 MB
Response time:		        0.79 secs
Transaction rate:	      225.59 trans/sec
Throughput:		        0.03 MB/sec
Concurrency:		      178.64
Successful transactions:           0
Failed transactions:	          16
Longest transaction:	       13.91
Shortest transaction:	        0.00
 
** SIEGE 4.1.6
** Preparing 200 concurrent users for battle.
The server is now under siege...
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[...]
[error] socket: read error Connection reset by peer sock.c:635: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: read error Connection reset by peer sock.c:635: Connection reset by peer
[error] socket: unable to connect sock.c:282: Connection reset by peer
[error] socket: read error Connection reset by peer sock.c:635: Connection reset by peer

Lifting the server siege...
Transactions:		       11696 hits
Availability:		       98.49 %
Elapsed time:		       20.98 secs
Data transferred:	        1.73 MB
Response time:		        0.20 secs
Transaction rate:	      557.48 trans/sec
Throughput:		        0.08 MB/sec
Concurrency:		      111.54
Successful transactions:           0
Failed transactions:	         179
Longest transaction:	        2.25
Shortest transaction:	        0.00