tests/siege/outputFiles/stdErr.txt
** SIEGE 4.1.6
** Preparing 1 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		        1631 hits
Availability:		      100.00 %
Elapsed time:		        1.72 secs
Data transferred:	        0.24 MB
Response time:		        0.00 secs
Transaction rate:	      948.26 trans/sec
Throughput:		        0.14 MB/sec
Concurrency:		        0.98
Successful transactions:           0
Failed transactions:	           0
Longest transaction:	        0.02
Shortest transaction:	        0.00
 
** SIEGE 4.1.6
** Preparing 20 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		        3040 hits
Availability:		      100.00 %
Elapsed time:		        1.98 secs
Data transferred:	        0.45 MB
Response time:		        0.01 secs
Transaction rate:	     1535.35 trans/sec
Throughput:		        0.23 MB/sec
Concurrency:		       17.84
Successful transactions:           0
Failed transactions:	           0
Longest transaction:	        0.06
Shortest transaction:	        0.00
 
** SIEGE 4.1.6
** Preparing 50 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		        3153 hits
Availability:		      100.00 %
Elapsed time:		        1.97 secs
Data transferred:	        0.47 MB
Response time:		        0.03 secs
Transaction rate:	     1600.51 trans/sec
Throughput:		        0.24 MB/sec
Concurrency:		       42.54
Successful transactions:           0
Failed transactions:	           0
Longest transaction:	        0.05
Shortest transaction:	        0.00
 
** SIEGE 4.1.6
** Preparing 100 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		        3517 hits
Availability:		      100.00 %
Elapsed time:		        1.74 secs
Data transferred:	        0.52 MB
Response time:		        0.05 secs
Transaction rate:	     2021.26 trans/sec
Throughput:		        0.30 MB/sec
Concurrency:		       98.59
Successful transactions:           0
Failed transactions:	           0
Longest transaction:	        0.08
Shortest transaction:	        0.00
 
** SIEGE 4.1.6
** Preparing 150 concurrent users for battle.
The server is now under siege...
[error] unable to write to socket sock.c:733: Broken pipe

Lifting the server siege...
Transactions:		        3421 hits
Availability:		       99.97 %
Elapsed time:		        1.89 secs
Data transferred:	        0.51 MB
Response time:		        0.08 secs
Transaction rate:	     1810.05 trans/sec
Throughput:		        0.27 MB/sec
Concurrency:		      141.34
Successful transactions:           0
Failed transactions:	           1
Longest transaction:	        1.14
Shortest transaction:	        0.00
 
** SIEGE 4.1.6
** Preparing 200 concurrent users for battle.
The server is now under siege...
[error] socket: unable to connect sock.c:282: Connection reset by peer

Lifting the server siege...
Transactions:		        1524 hits
Availability:		       99.93 %
Elapsed time:		        1.91 secs
Data transferred:	        0.23 MB
Response time:		        0.12 secs
Transaction rate:	      797.91 trans/sec
Throughput:		        0.12 MB/sec
Concurrency:		       99.05
Successful transactions:           0
Failed transactions:	           1
Longest transaction:	        1.05
Shortest transaction:	        0.00
 
** SIEGE 4.1.6
** Preparing 200 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		         189 hits
Availability:		      100.00 %
Elapsed time:		        1.92 secs
Data transferred:	        0.03 MB
Response time:		        0.04 secs
Transaction rate:	       98.44 trans/sec
Throughput:		        0.01 MB/sec
Concurrency:		        3.83
Successful transactions:           0
Failed transactions:	           0
Longest transaction:	        0.12
Shortest transaction:	        0.00